In [2]:
!python -m pip install pandas

Requirement already satisfied: pandas in c:\users\dhiraj\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dhiraj\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dhiraj\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dhiraj\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dhiraj\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\dhiraj\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [ ]:
# 1.	Load the retail_sales_dataset.csv file into a Pandas DataFrame.

df = pd.read_csv("retail_sales_dataset.csv")

In [4]:
# 2.	Display the first 10 rows of the dataset.

df.head(10)

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,24-11-2023,CUST001,Male,34,Beauty,3,50,150
1,2,27-02-2023,CUST002,Female,26,Clothing,2,500,1000
2,3,13-01-2023,CUST003,Male,50,Electronics,1,30,30
3,4,21-05-2023,CUST004,Male,37,Clothing,1,500,500
4,5,06-05-2023,CUST005,Male,30,Beauty,2,50,100
5,6,25-04-2023,CUST006,Female,45,Beauty,1,30,30
6,7,13-03-2023,CUST007,Male,46,Clothing,2,25,50
7,8,22-02-2023,CUST008,Male,30,Electronics,4,25,100
8,9,13-12-2023,CUST009,Male,63,Electronics,2,300,600
9,10,07-10-2023,CUST010,Female,52,Clothing,4,50,200

In [5]:
# 3.	Check the total number of rows and columns.

df.shape

(1000, 9)

In [6]:
# 4.	Display column names and their data types.

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Date              1000 non-null   object
 2   Customer ID       1000 non-null   object
 3   Gender            1000 non-null   object
 4   Age               1000 non-null   int64
 5   Product Category  1000 non-null   object
 6   Quantity          1000 non-null   int64
 7   Price per Unit    1000 non-null   int64
 8   Total Amount      1000 non-null   int64
dtypes: int64(5), object(4)
memory usage: 70.4+ KB

In [7]:
# 5.	Find the number of unique customers in the dataset.

df["Customer ID"].nunique()

1000

In [9]:
# 6.	Filter all transactions where Product Category is "Clothing".

clothing_Sales = df[df["Product Category"] == "Clothing"]

print(clothing_Sales)

     Transaction ID        Date Customer ID  Gender  Age Product Category  \
1                 2  27-02-2023     CUST002  Female   26         Clothing
3                 4  21-05-2023     CUST004    Male   37         Clothing
6                 7  13-03-2023     CUST007    Male   46         Clothing
9                10  07-10-2023     CUST010  Female   52         Clothing
10               11  14-02-2023     CUST011    Male   23         Clothing
..              ...         ...         ...     ...  ...              ...
986             987  29-04-2023     CUST987  Female   30         Clothing
987             988  28-05-2023     CUST988  Female   63         Clothing
990             991  26-12-2023     CUST991  Female   34         Clothing
994             995  30-04-2023     CUST995  Female   41         Clothing
995             996  16-05-2023     CUST996    Male   62         Clothing

     Quantity  Price per Unit  Total Amount
1           2             500          1000
3           1             500           500
6           2              25            50
9           4              50           200
10          2              50           100
..        ...             ...           ...
986         3             300           900
987         3              25            75
990         2              50           100
994         1              30            30
995         1              50            50

[351 rows x 9 columns]

In [10]:
# 7.	Find all transactions where Total Amount is greater than 1000.

high_value_sales = df[df["Total Amount"] > 1000]
print(high_value_sales)

     Transaction ID        Date Customer ID  Gender  Age Product Category  \
12               13  05-08-2023     CUST013    Male   22      Electronics
14               15  16-01-2023     CUST015  Female   42      Electronics
15               16  17-02-2023     CUST016    Male   19         Clothing
30               31  23-05-2023     CUST031    Male   44      Electronics
45               46  26-06-2023     CUST046  Female   20      Electronics
..              ...         ...         ...     ...  ...              ...
941             942  18-03-2023     CUST942    Male   51         Clothing
942             943  16-10-2023     CUST943  Female   57         Clothing
945             946  08-05-2023     CUST946    Male   62      Electronics
955             956  19-08-2023     CUST956    Male   30         Clothing
969             970  16-05-2023     CUST970    Male   59      Electronics

     Quantity  Price per Unit  Total Amount
12          3             500          1500
14          4             500          2000
15          3             500          1500
30          4             300          1200
45          4             300          1200
..        ...             ...           ...
941         3             500          1500
942         4             300          1200
945         4             500          2000
955         3             500          1500
969         4             500          2000

[153 rows x 9 columns]

In [12]:
# 8.	Calculate the total revenue generated from all sales.

df["Total Amount"].sum()

np.int64(456000)

In [13]:
# 9.	Calculate the average Price per Unit for each product category.

df.groupby("Product Category")["Price per Unit"].mean()

Product Category
Beauty         184.055375
Clothing       174.287749
Electronics    181.900585
Name: Price per Unit, dtype: float64

In [14]:
# 10.	Find the total quantity sold for each product category.

df.groupby("Product Category")["Quantity"].sum()

Product Category
Beauty         771
Clothing       894
Electronics    849
Name: Quantity, dtype: int64

In [15]:
# 11.	Count the number of transactions made by each gender.

df["Gender"].value_counts()

Gender
Female    510
Male      490
Name: count, dtype: int64

In [16]:
# 12.	Find the average Total Amount spent by male vs female customers.

df.groupby("Gender")["Total Amount"].mean()

Gender
Female    456.549020
Male      455.428571
Name: Total Amount, dtype: float64

In [18]:
# 13.	Identify customers who have made more than one transaction.

customer_counts = df["Customer ID"].value_counts()
repeat_customers = customer_counts[customer_counts > 1]

print(repeat_customers)

Series([], Name: count, dtype: int64)

In [20]:
# 14.	Sort the dataset by Total Amount in descending order and show the top 5 rows.

df.sort_values("Total Amount", ascending=False).head(5)

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
64,65,2023-12-05,CUST065,Male,51,Electronics,4,500,2000
280,281,2023-05-23,CUST281,Female,29,Beauty,4,500,2000
268,269,2023-02-01,CUST269,Male,25,Clothing,4,500,2000
663,664,2023-12-28,CUST664,Female,44,Clothing,4,500,2000
633,634,2023-10-08,CUST634,Male,60,Electronics,4,500,2000

In [21]:
# 15.	Convert the Date column into datetime format.
df["Date"] = pd.to_datetime(df["Date"])

In [22]:
# 16.	Extract month and year from the Date column and add them as new columns.

df["Year"] = df["Date"].dt.year
df["Month"] = df["Date"].dt.month

In [24]:
# 17.	Calculate total monthly revenue.

monthly_revenue = df.groupby(["Year", "Month"])["Total Amount"].sum()
print(monthly_revenue)

Year  Month
2023  1        35450
      2        44060
      3        28990
      4        33870
      5        53150
      6        36715
      7        35465
      8        36960
      9        23620
      10       46580
      11       34920
      12       44690
2024  1         1530
Name: Total Amount, dtype: int64

In [25]:
# 18.	Identify the month with the highest total sales.

monthly_revenue.idxmax(), monthly_revenue.max()

((np.int32(2023), np.int32(5)), np.int64(53150))

In [26]:
# 19.	Find the age group (e.g., <25, 25–40, 40+) that contributes the most revenue.

bins = [0, 25, 40, 100]
labels = ["<25", "25-40", "40+"]

df["Age Group"] = pd.cut(df["Age"], bins=bins, labels=labels)

df.groupby("Age Group")["Total Amount"].sum()

C:\Users\Dhiraj\AppData\Local\Temp\ipykernel_16852\1349700850.py:8: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("Age Group")["Total Amount"].sum()

Age Group
<25       84550
25-40    144345
40+      227105
Name: Total Amount, dtype: int64

In [27]:
# 20.	Verify whether Total Amount = Quantity × Price per Unit for all rows and identify mismatches, if any.

df["Calculated Amount"] = df["Quantity"] * df["Price per Unit"]

mismatch = df[df["Total Amount"] != df["Calculated Amount"]]
mismatch

Empty DataFrame
Columns: [Transaction ID, Date, Customer ID, Gender, Age, Product Category, Quantity, Price per Unit, Total Amount, Year, Month, Age Group, Calculated Amount]
Index: []